cf/Reports/ОтчетАВС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетАВС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Критерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодСт</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПрайса</Name>
					<Comment>кода устоновили цену в навижене</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПродажи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Акция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Reports/ОтчетАВС/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	Запрос = Новый Запрос;
	               ///////Цены по типу "Себестоимость"
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2)) КАК ЦенаСебестоимость
	               |ПОМЕСТИТЬ ТипЦенСебестоимость
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодЦен, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               ///Цены по типу ""Закупочная руб""
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				   |	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(15, 2)) КАК ЦенаЗакупочная
				   |ПОМЕСТИТЬ ТипЦенЗакупочныйРуб
				   |ИЗ
				   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодЦен, ТипЦен = &ТипЦен1) КАК ЦеныНоменклатурыСрезПоследних
				   |;
				   ///Теперь срастим их 
				   |ВЫБРАТЬ
				   |	ТипЦенСебестоимость.Номенклатура КАК Номенклатура,
				   |	ТипЦенСебестоимость.ЦенаСебестоимость КАК ЦенаСебестоимость,
				   |	0 КАК ЦенаЗакупочная
				   |ПОМЕСТИТЬ ЦеныСебестоимостьВР
				   |ИЗ
				   |	ТипЦенСебестоимость
				   |
				   |ОБЪЕДИНИТЬ
				   |
				   |ВЫБРАТЬ
				   |	ТипЦенЗакупочныйРуб.Номенклатура КАК Номенклатура,
				   |	0,
				   |	ТипЦенЗакупочныйРуб.ЦенаЗакупочная
				   |ИЗ
				   |	ТипЦенЗакупочныйРуб
				   |;
				   |
				   |ВЫБРАТЬ
				   |	ЦеныСебестоимостьВР.Номенклатура КАК Номенклатура,
				   |ВЫБОР КОГДА ЦеныСебестоимостьВР.ЦенаСебестоимость = 0 ТОГДА ЦеныСебестоимостьВР.ЦенаЗакупочная ИНАЧЕ ЦеныСебестоимостьВР.ЦенаСебестоимость КОНЕЦ КАК Цена
				   |ПОМЕСТИТЬ ЦеныСебестоимость
				   |ИЗ
				   |	ЦеныСебестоимостьВР
				   |;
				   ///все, что написанно выше, можно сделать проще. Как придумаю как, обязательно сделаю.
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПродажиОбороты.Номенклатура,
	               |	ВЫРАЗИТЬ(ПродажиОбороты.СуммаОборот КАК ЧИСЛО(15, 2)) КАК СуммаОборот,
	               |	ВЫРАЗИТЬ(ПродажиОбороты.КоличествоОборот КАК ЧИСЛО(15, 2)) КАК КоличествоОборот
	               |ПОМЕСТИТЬ Продажи
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиОбороты
	               |ГДЕ
	               |	ПродажиОбороты.СуммаОборот > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Продажи.Номенклатура,
	               |	Продажи.КоличествоОборот * ЕСТЬNULL(ЦеныСебестоимость.Цена, 0) КАК Себестоимость,
	               |	Продажи.СуммаОборот,
	               |	ВЫБОР
	               |		КОГДА Продажи.СуммаОборот - Продажи.КоличествоОборот * ЕСТЬNULL(ЦеныСебестоимость.Цена, 0) <= 0
	               |			ТОГДА 0
	               |		ИНАЧЕ Продажи.СуммаОборот - Продажи.КоличествоОборот * ЕСТЬNULL(ЦеныСебестоимость.Цена, 0)
	               |	КОНЕЦ КАК Выручка
	               |ПОМЕСТИТЬ ВрТаб
	               |ИЗ
	               |	Продажи КАК Продажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСебестоимость КАК ЦеныСебестоимость
	               |		ПО Продажи.Номенклатура = ЦеныСебестоимость.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВРТаб.Выручка) КАК ВыручкаИтог
	               |ПОМЕСТИТЬ ИтогОбщ
	               |ИЗ
	               |	ВрТаб КАК ВРТаб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВрТаб.Номенклатура КАК Номенклатура,
	               |	ВрТаб.Себестоимость КАК Себестоимость,
	               |	ВрТаб.СуммаОборот КАК Продажи,
	               |	ВрТаб.Выручка КАК Выручка,
	               |	&КатегорияА,
	               |	&КатегорияВ,
	               |	&КатегорияС,
	               |	ВрТаб.Выручка / ИтогОбщ.ВыручкаИтог * 100 КАК УДВес
	               |ИЗ
	               |	ВрТаб КАК ВрТаб
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ИтогОбщ КАК ИтогОбщ
	               |		ПО (ИСТИНА)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УДВес УБЫВ";
	Запрос.УстановитьПараметр("КатегорияА", КатегорияА);
	Запрос.УстановитьПараметр("КатегорияВ", КатегорияВ);
	Запрос.УстановитьПараметр("КатегорияС", КатегорияС);
	Запрос.УстановитьПараметр("НачалоПериода", ПериодСт.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ПериодСт.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодЦен", ?(ЗначениеЗаполнено(ПериодСт.ДатаОкончания),ПериодСт.ДатаОкончания, КонецДня(ТекущаяДата())));
	//ПараметрТипыЦен = Новый Массив;
	//ПараметрТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоНаименованию("Себестоимость"));
	//ПараметрТипыЦен.Добавить(Справочники.ТипыЦен.НайтиПоНаименованию());
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.НайтиПоНаименованию("Себестоимость"));
	Запрос.УстановитьПараметр("ТипЦен1", Справочники.ТипыЦен.НайтиПоНаименованию("Закупочная руб"));
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	////
	//Для Каждого Стр Из ТаблицаДанных Цикл
	//	
	//КонецЦикла;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаНабораДанных", ТаблицаДанных);
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);//,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"),,);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
КонецПроцедуры
